<template>
  <div class="container mt-5">
    <div class="card shadow p-5">
      <h2 class="h2"><svg xmlns="http://www.w3.org/2000/svg" width="28" height="28" fill="currentColor" class="bi bi-3-square" viewBox="0 0 16 16">
  <path d="M7.918 8.414h-.879V7.342h.838c.78 0 1.348-.522 1.342-1.237 0-.709-.563-1.195-1.348-1.195-.79 0-1.312.498-1.348 1.055H5.275c.036-1.137.95-2.115 2.625-2.121 1.594-.012 2.608.885 2.637 2.062.023 1.137-.885 1.776-1.482 1.875v.07c.703.07 1.71.64 1.734 1.917.024 1.459-1.277 2.396-2.93 2.396-1.705 0-2.707-.967-2.754-2.144H6.33c.059.597.68 1.06 1.541 1.066.973.006 1.6-.563 1.588-1.354-.006-.779-.621-1.318-1.541-1.318"/>
  <path d="M0 2a2 2 0 0 1 2-2h12a2 2 0 0 1 2 2v12a2 2 0 0 1-2 2H2a2 2 0 0 1-2-2zm15 0a1 1 0 0 0-1-1H2a1 1 0 0 0-1 1v12a1 1 0 0 0 1 1h12a1 1 0 0 0 1-1z"/>
</svg> 
期待與目標</h2>
      <p>了解到貴公司注重在企業AI的應用 整合大型語言模型的 UI 流程與互動體驗<br> 
        我認為自己在以下幾方面特質可以為團隊帶來貢獻：</p>
      <ul class="list-unstyled">
        <li>📌學習能力強: 做中學寫後端程式、願意不斷學習新技術</li>
        <li>📌重視程式碼邏輯與維護性</li>
        <li>📌良好的溝通協作能力，能與後端/PM 協作順暢</li>
        <li>📌願意主動解決問題，能針對使用者體驗提供優化建議</li>
      </ul>
      <div class="fs-5">
        希望能有機會進入公司與優秀團隊合作，精進開發技術，與團隊一起成長，謝謝！
      </div>
    </div>
  </div>
</template>
